text = input('введите текст: ')

alphabet_lower = {'а':'11', 'б':'12', 'в':'13', 'г':'14', 'д':'15', 'е':'16', 
                  'ж':'21', 'з':'22', 'и':'23', 'й':'24', 'к':'25', 'л':'26', 
                  'м':'31', 'н':'32', 'о':'33', 'п':'34', 'р':'35', 'с':'36',
                  'т':'41', 'у':'42', 'ф':'43', 'х':'44', 'ц':'45', 'ч':'46',
                  'ш':'51', 'щ':'52', 'ъ':'53', 'ы':'54', 'ь':'55', 'э':'56',
                  'ю':'61', 'я':'62',
                  }

crypt = ''
for letter in text:
    if letter in alphabet_lower:
        letter = alphabet_lower.get(letter) #возвращает значение цифры для буквы
        crypt += str(letter) # вставить цифры
        crypt += ' ' # вставить пробел после цифры

print("исходный текст : ", text)
print("рашифрованный текст : ", crypt)

temp = ''
decrypt = ''
for i in crypt:
    if i != ' ': #Если пробел - преход на след значение
        temp += i
    else:
        for j in alphabet_lower:
            if alphabet_lower[j] == temp: # Возвращает букву при получении цифры
                decrypt +=j
        temp = ''
        
print("расшифрованный текст : ", decrypt)
